palanurag23/SMHMI/home_panel/cm7/board/pin_mux.h
/*
 * Copyright 2020-2022 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures LPUART pins used for debug console.
 *
 */
void BOARD_InitLpuartPins(void);

/*!
 * @brief Configures microphones pins.
 *
 */
void BOARD_InitMicPins(void);

/*!
 * @brief Configures WiFi pins.
 *
 */
void BOARD_InitWiFiPins(void);

/*!
 * @brief Configures MQS pins.
 *
 */
void BOARD_InitMqsPins(void);

void BOARD_InitFlexioCameraPins(void);


#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
